app/views/symptoms/new.html.erb

SELECT "symptoms".* FROM "symptoms"
SELECT COUNT(*) FROM "user_symptoms" WHERE "user_symptoms"."user_id" = $1  [["user_id", 23]]
---
<%= render :partial => 'nav' %>
<% if @current_user.user_symptoms.count != 0 %>

SELECT "symptoms".* FROM "symptoms"
---
  end %>
  <% Symptom.all.each do |symptom|%>
    <%= check_box_tag "symptom[]", symptom.id, @symptoms.include?(symptom.id)%>

SELECT "symptoms".* FROM "symptoms"
---
  <%= form_tag symptoms_path, :method => 'post' do  %>
    <% Symptom.all.each do |symptom|%>
      <%= check_box_tag "symptom[]", symptom.id, @symptoms.include?(symptom.id)%>