app/controllers/symptoms_controller.rb

  def new
    @symptoms = Symptom.all
---
SELECT "symptoms".* FROM "symptoms"

  def create
    @symptoms = []
    if params[:symptom] != nil
      ##Updating changes
      if @current_user.user_symptoms.count != nil
        temp_symptoms = []
        userSymptoms = @current_user.user_symptoms
        userSymptoms.each do |row|
         temp_symptoms.push(row.symptom_id.to_s)
        end
        ####Difference or removed symptom ids
        removed_symptoms = temp_symptoms - params[:symptom]

        userSymptoms.each do |row|
          if removed_symptoms.include? row.symptom_id.to_s
            row.destroy
          end
        end
      end
      ##Creting new usersymptoms with selected inputs
      crete_symptoms_list = params[:symptom] - temp_symptoms
      crete_symptoms_list.each do |id|
        userSymptom1 = UserSymptom.create :user_id => @current_user.id, :symptom_id => id.to_i
        removeDuplicates
      end

      if @current_user.user_symptoms.count != 0
          userSymptoms = @current_user.user_symptoms
          userSymptoms.each do |row|
            @symptoms.push(row.symptom_id)
---
SELECT COUNT(*) FROM "user_symptoms" WHERE "user_symptoms"."user_id" = $1  [["user_id", 23]]
SELECT "user_symptoms".* FROM "user_symptoms" WHERE "user_symptoms"."user_id" = $1  [["user_id", 23]]
INSERT INTO "user_symptoms" ("symptom_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["symptom_id", 33], ["user_id", 23], ["created_at", "2021-04-29 10:04:25.744313"], ["updated_at", "2021-04-29 10:04:25.744313"]]
DELETE FROM "user_symptoms" WHERE "user_symptoms"."id" = $1  [["id", 63]]
INSERT INTO "user_symptoms" ("symptom_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["symptom_id", 31], ["user_id", 23], ["created_at", "2021-04-29 11:09:58.325652"], ["updated_at", "2021-04-29 11:09:58.325652"]]
INSERT INTO "user_symptoms" ("symptom_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["symptom_id", 32], ["user_id", 23], ["created_at", "2021-04-29 11:01:36.981800"], ["updated_at", "2021-04-29 11:01:36.981800"]]

  def removeDuplicates
    userSymptoms = @current_user.user_symptoms
    group = userSymptoms.group_by{ |userSymptom| [userSymptom.symptom_id]}
---
SELECT "user_symptoms".* FROM "user_symptoms" WHERE "user_symptoms"."user_id" = $1  [["user_id", 23]]