app/controllers/users_controller.rb

INSERT INTO "users" ("email", "suburb", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["email", "test3@test3.com"], ["suburb", "Burwood"], ["password_digest", "$2a$12$Emy3Hslzv.G/uPVQKB.KiePsnm5bGPLe9VD5GafnxNtCVB5hkb4Ei"]]
---
 def create
   @user = User.create user_params